Tekla Open API Reference for Tekla Structures 2025
Events.UndoClicked Event
 Occurs when user clicks undo.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public event Events.UndoClickedDelegate UndoClicked
Public Event UndoClicked As Events.UndoClickedDelegate
Value
Type: Tekla.Structures.Model.Events.UndoClickedDelegate
See Also
Reference
Events Class
Tekla.Structures.Model Namespace